УТ_для_edt.РасширениеСмарт/src/DataProcessors/РаботаСФайлами/РаботаСФайлами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="20feb794-eb05-46a6-90e7-ca4e2376d7b2">
  <name>РаботаСФайлами</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/Catalogs/СерииНоменклатурыПрисоединенныеФайлы/СерииНоменклатурыПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a1c03d80-ad98-4b88-b1ed-4568b1067fcb">
  <name>СерииНоменклатурыПрисоединенныеФайлы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="74c22bcb-3b25-4b72-bb9e-d474003fdf07">
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73bcad43-ce67-4dc7-a458-c466e578ee8b">
    <name>ВладелецФайла</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/РаботаСФайлами/Forms/ПрисоединенныеФайлы/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("НастроитьДинамическийСписок")
//++ #Б-1498 смарт: Фролов 12.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
Процедура смарт_НастроитьДинамическийСписок(ИмяСправочникаХранилищаФайлов, Знач ЕстьРеквизитСлужебный)

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
	|			ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
	|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
	|	КОНЕЦ КАК ИндексКартинки,
	|	Файлы.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
	|	Файлы.Автор,
	|	Файлы.ДатаСоздания,
	|	Файлы.Изменил КАК Отредактировал,
	|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
	|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
	|	Файлы.ПодписанЭП,
	|	Файлы.Зашифрован,
	|	ВЫБОР
	|		КОГДА Файлы.ПодписанЭП
	|				И Файлы.Зашифрован
	|			ТОГДА 2
	|		КОГДА Файлы.Зашифрован
	|			ТОГДА 1
	|		КОГДА Файлы.ПодписанЭП
	|			ТОГДА 0
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируется,
	|	ВЫБОР
	|		КОГДА Файлы.Редактирует = &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируетТекущийПользователь,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|				И Файлы.Редактирует <> &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируетДругойПользователь,
	|	Файлы.Расширение КАК Расширение,
	|	ВЫБОР
	|		КОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись <> НЕОПРЕДЕЛЕНО
	|				И Файлы.Редактирует = НЕОПРЕДЕЛЕНО
	|			ТОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись
	|		ИНАЧЕ Файлы.Редактирует
	|	КОНЕЦ КАК Редактирует,
	|	Файлы.Редактирует КАК РедактируетПользователь,
	|	&ЭтоГруппа КАК ЭтоГруппа,
	|	&Служебный КАК Служебный,
	|	Файлы.ВладелецФайла КАК ВладелецФайла, 
	#Вставка
	//++ #1260 смарт: Фролов 05.12.2022 //Прикрепить фото к сериям оборудования
	|	1 = 1 КАК Основной,	
	//-- #1260 смарт: Фролов 05.12.2022
	#КонецВставки
	#Вставка
	//++ #Б-1498 смарт: Фролов 12.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
	|	2 = 2 КАК НазначениеФайла,
	//-- #Б-1498 смарт: Фролов 12.12.2024
	#КонецВставки
	|	Файлы.ХранитьВерсии КАК ХранитьВерсии
	|ИЗ
	|	&ИмяСправочника КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСинхронизацииФайловСОблачнымСервисом КАК СтатусыСинхронизацииФайловСОблачнымСервисом
	|		ПО Файлы.Ссылка = СтатусыСинхронизацииФайловСОблачнымСервисом.Файл
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайлов";
	
	#Вставка
	//++ #1260 смарт: Фролов 05.12.2022 //Прикрепить фото к сериям оборудования 
	Если ИмяСправочникаХранилищаФайлов="СерииНоменклатурыПрисоединенныеФайлы" ТОгда
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса, "1 = 1", "Файлы.Основной");
	Иначе	
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса, "1 = 1", "Ложь");
	КонецЕсли;
	//-- #1260 смарт: Фролов 05.12.2022
	#КонецВставки
	
	#Вставка
	//++ #Б-1498 смарт: Фролов 12.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
	Если ИмяСправочникаХранилищаФайлов="смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы" ТОгда
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса, "2 = 2", "Файлы.НазначениеФайла");
	Иначе	
		ТекстЗапроса=СтрЗаменить(ТекстЗапроса, "2 = 2", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	//-- #Б-1498 смарт: Фролов 12.12.2024
	#КонецВставки

	ПолноеИмяСправочника = "Справочник." + ИмяСправочникаХранилищаФайлов;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяСправочника", ПолноеИмяСправочника);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Служебный", ?(ЕстьРеквизитСлужебный, "Файлы.Служебный", "ЛОЖЬ"));

	СвойстваСписка.ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоГруппа",
	?(ВозможностьСоздаватьГруппыФайлов, "Файлы.ЭтоГруппа", "ЛОЖЬ"));

	СвойстваСписка.ОсновнаяТаблица  = ПолноеИмяСправочника;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);

	ПустыеПользователи = Новый Массив;
	ПустыеПользователи.Добавить(Неопределено);
	ПустыеПользователи.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.ВнешниеПользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.УчетныеЗаписиСинхронизацииФайлов.ПустаяСсылка());

	Список.Параметры.УстановитьЗначениеПараметра("ВладелецФайлов",      Параметры.ВладелецФайла);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Список.Параметры.УстановитьЗначениеПараметра("ПустыеПользователи",  ПустыеПользователи);

	ДатаУниверсальная = ТекущаяДатаСеанса();
	Список.Параметры.УстановитьЗначениеПараметра("СекундДоМестногоВремени",
	МестноеВремя(ДатаУниверсальная, ЧасовойПоясСеанса()) - ДатаУниверсальная);

КонецПроцедуры //-- #Б-1498 смарт: Фролов 12.12.2024

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
//++ #Б-1498 смарт: Фролов 12.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВладелецФайла = Параметры.ВладелецФайла;

	ТекущаяСсылка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТекущаяСтрока");
	СписокОткрытИзКарточкиФайла = ЗначениеЗаполнено(ТекущаяСсылка);
	Элементы.ВладелецФайла.Видимость = СписокОткрытИзКарточкиФайла И Не Параметры.СкрыватьВладельца;
	Если СписокОткрытИзКарточкиФайла И ВладелецФайла = Неопределено Тогда
		ВладелецФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСсылка, "ВладелецФайла");
		Параметры.ВладелецФайла = ВладелецФайла;
	КонецЕсли;
	Если Параметры.ВладелецФайла = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Список присоединенных файлов можно посмотреть
		|только в форме объекта-владельца.'");
	КонецЕсли;

	ТипВладельца = ТипЗнч(Параметры.ВладелецФайла);
	Если Метаданные.ОпределяемыеТипы.ВладелецФайлов.Тип.СодержитТип(ТипВладельца) Тогда
		ПолноеИмяВладельца = Метаданные.НайтиПоТипу(ТипВладельца).Имя;
		Если Метаданные.Справочники.Найти(ПолноеИмяВладельца + "ПрисоединенныеФайлы") = Неопределено Тогда
			ЭтоВладелецЭлементовСправочникаФайлы = Истина;
		КонецЕсли;
	КонецЕсли;

	Элементы.ФормаРедактировать.ТолькоВоВсехДействиях           = Параметры.ПростаяФорма;
	Элементы.ФормаОткрыть.ТолькоВоВсехДействиях                 = Параметры.ПростаяФорма;
	Элементы.ФормаЗакончитьРедактирование.ТолькоВоВсехДействиях = Параметры.ПростаяФорма;
	Элементы.СписокВажныеРеквизиты.Видимость                    = Не Параметры.ПростаяФорма;
	Предпросмотр                                                = Параметры.ПростаяФорма;

	ПоказыватьКолонкуРазмер = РаботаСФайламиСлужебный.ПолучитьПоказыватьКолонкуРазмер();
	Если Не ПоказыватьКолонкуРазмер Тогда
		Элементы.СписокРазмер.Видимость = Ложь;
	КонецЕсли;

	Если Не ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	ИначеЕсли СписокОткрытИзКарточкиФайла Тогда
		Заголовок = Заголовок + ": " + ОбщегоНазначения.ПредметСтрокой(ВладелецФайла);
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ПараметрыОтправки) Тогда
		ПараметрыОтправки = Параметры.ПараметрыОтправки;
	Иначе
		ПараметрыОтправки = РаботаСФайламиСлужебный.ПодготовитьСтруктуруПараметровОтправки();
	КонецЕсли;

	Если Параметры.РежимВыбора Тогда
		СтандартныеПодсистемыСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, "ВыборПодбор");
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Заголовок = НСтр("ru = 'Выбор присоединенного файла'");
	Иначе
		Элементы.Список.РежимВыбора = Ложь;
	КонецЕсли;

	НастройкиФайлов = РаботаСФайламиСлужебный.НастройкиФайлов();

	ИмяСправочникаХранилищаФайлов = Неопределено;

	ЗаголовокОшибки = НСтр("ru = 'Ошибка при настройке динамического списка присоединенных файлов.'");
	ОкончаниеОшибки = НСтр("ru = 'В этом случае настройка динамического списка невозможна.'");

	ИмяСправочникаХранилищаФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(
	Параметры.ВладелецФайла, "", ЗаголовокОшибки, ОкончаниеОшибки);

	ТипСправочникаСФайлами = Тип("СправочникСсылка." + ИмяСправочникаХранилищаФайлов);

	МетаданныеСправочникаСФайлами = Метаданные.НайтиПоТипу(ТипСправочникаСФайлами);

	ИмяСправочникаХранилищаВерсийФайлов = РаботаСФайламиСлужебный.ИмяСправочникаХраненияВерсийФайлов(
	Параметры.ВладелецФайла, "", ЗаголовокОшибки, ОкончаниеОшибки);

	ВозможностьСоздаватьГруппыФайлов = МетаданныеСправочникаСФайлами.Иерархический;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда 
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		ЕстьПравоИспользоватьШаблоны = МодульУправлениеДоступом .ЕстьПраво("Чтение", Справочники.ПапкиФайлов.Шаблоны);
	Иначе
		ЕстьПравоИспользоватьШаблоны = ПравоДоступа("Чтение", Метаданные.Справочники.Файлы) И ПравоДоступа("Чтение", Метаданные.Справочники.ПапкиФайлов)
	КонецЕсли;

	Если НЕ ЕстьПравоИспользоватьШаблоны Или НастройкиФайлов.НеСоздаватьФайлыПоШаблону.Найти(Метаданные.НайтиПоТипу(ТипЗнч(ВладелецФайла))) <> Неопределено Тогда
		Элементы.ДобавитьФайлПоШаблону.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюДобавитьФайлПоШаблону.Видимость = Ложь;
	КонецЕсли;

	ВозможностьСоздаватьВерсииФайлов = ЭтоВладелецЭлементовСправочникаФайлы;

	Если ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		РаботаСФайламиСлужебный.ИзменитьФормуДляВнешнегоПользователя(ЭтотОбъект, Истина);
	КонецЕсли;

	ЕстьРеквизитСлужебный = РаботаСФайламиСлужебный.ЕстьРеквизитСлужебный(ИмяСправочникаХранилищаФайлов);
	НастроитьДинамическийСписок(ИмяСправочникаХранилищаФайлов, ЕстьРеквизитСлужебный);

	Если Не ВозможностьСоздаватьГруппыФайлов Тогда
		СкрытьКнопкиСозданияГруппы();
	КонецЕсли;

	ЕстьПравоДобавления = Истина;
	Если НЕ ПравоДоступа("ИнтерактивноеДобавление", МетаданныеСправочникаСФайлами) Тогда
		СкрытьКнопкиДобавления();
		ЕстьПравоДобавления = Ложь;
	КонецЕсли;

	Если Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		ТолькоПросмотр = Не ПравоДоступа("Редактирование", МетаданныеСправочникаСФайлами);
	Иначе
		ТолькоПросмотр = Не ПравоДоступа("Редактирование", МетаданныеСправочникаСФайлами)
		Или Не ПравоДоступа("Редактирование", Параметры.ВладелецФайла.Метаданные());
		
		#Вставка
		//++ #Б5372 смарт: Шляпников 20.01.2026 / Доработать механизм контроля подписания УПД
		Если МетаданныеСправочникаСФайлами.Имя = "РеализацияТоваровУслугПрисоединенныеФайлы" Тогда
			ТолькоПросмотр = Не ПравоДоступа("Редактирование", МетаданныеСправочникаСФайлами);
		КонецЕсли;
		//-- #Б5372 смарт: Шляпников 20.01.2026
		#КонецВставки
		
	КонецЕсли;

	Если ТолькоПросмотр Тогда
		СкрытьКнопкиИзменения();
	КонецЕсли;

	ИменаВсехКомандФормы = ПолучитьИменаКомандФормы();
	ИменаЭлементов = Новый Массив;

	Для Каждого ЭлементФормы Из Элементы Цикл

		Если ТипЗнч(ЭлементФормы) <> Тип("КнопкаФормы") Тогда
			Продолжить;
		КонецЕсли;

		Если ИменаВсехКомандФормы.Найти(ЭлементФормы.ИмяКоманды) <> Неопределено
			Или ИменаВсехКомандФормы.Найти(ЭлементФормы.Имя) <> Неопределено Тогда
			ИменаЭлементов.Добавить(ЭлементФормы.Имя);
		КонецЕсли;

	КонецЦикла;

	ИменаЭлементовКнопокФормы = Новый ФиксированныйМассив(ИменаЭлементов);

	ПриИзмененииИспользованияПодписанияИлиШифрованияНаСервере();

	ИспользоватьПредпросмотр = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	ТипСправочникаСФайлами,
	"Предпросмотр");

	Если ИспользоватьПредпросмотр <> Неопределено Тогда
		Предпросмотр = ИспользоватьПредпросмотр;
	КонецЕсли;

	Элементы.АдресДанныхФайла.Видимость = Предпросмотр;
	Элементы.Предпросмотр.Пометка       = Предпросмотр;

	РасширенияПоддерживающиеПредпросмотр = РаботаСФайламиСлужебный.СписокРасширенийДляПредпросмотра();

	ОбновитьПояснениеОблачногоСервиса();

	Элементы.НастроитьСинхронизацию.Видимость = ПравоДоступа("Редактирование", Метаданные.Справочники.УчетныеЗаписиСинхронизацииФайлов);
	ЕстьЭлектроннаяПодпись = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись");
	Элементы.ПечатьСоШтампом.Видимость = ЕстьЭлектроннаяПодпись;

	Элементы.СравнитьФайлы.Видимость = Не ОбщегоНазначения.ЭтоLinuxКлиент() И Не ОбщегоНазначения.ЭтоВебКлиент();

	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();

	Элементы.ПоказыватьСлужебныеФайлы.Видимость = ЕстьРеквизитСлужебный
	И Пользователи.ЭтоПолноправныйПользователь();

	УстановитьУсловноеОформление(ЕстьРеквизитСлужебный);
	Если ЕстьРеквизитСлужебный Тогда
		РаботаСФайламиСлужебный.ДобавитьОтборыВСписокФайлов(Список);
	Иначе
		РаботаСФайламиСлужебный.УстановитьОтборПоПометкеУдаления(Список.Отбор);
	КонецЕсли;

	РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов(ЭтотОбъект);

	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ПодменюДобавить.Отображение = ОтображениеКнопки.Картинка;
		Элементы.ДобавитьФайлСоСканера.Заголовок = НСтр("ru = 'С камеры устройства...'");
	КонецЕсли; 
	
	#Вставка
	//++ #1260 смарт: Фролов 05.12.2022 //Прикрепить фото к сериям оборудования  
	Если ТипЗнч(ВладелецФайла) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		НоваяКоманда = ЭтаФорма.Команды.Добавить("смартСделатьОсновным");
		НоваяКоманда.Заголовок = "Сделать основным (смарт)";
		НоваяКоманда.Действие = "смартСделатьОсновным";
		КнопкаОИД = ЭтаФорма.Элементы.Добавить("КнопкаОИД", Тип("КнопкаФормы"), Элементы.ФормаГруппаКомандОсновные);
		КнопкаОИД.Заголовок = "Сделать основным (смарт)";
		КнопкаОИД.ИмяКоманды = "смартСделатьОсновным"; 
		
		Элемент = Элементы.Добавить("СписокОсновной", Тип("ПолеФормы"), Элементы.Список);
		Элемент.ПутьКДанным = "Список.Основной";
		Элемент.Заголовок = "Основной (смарт)";
		Элемент.Видимость = Ложь;
		
		Элемент3 = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента3 = Элемент3.Поля.Элементы.Добавить();
		ПолеЭлемента3.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
		ОтборЭлемента3 = Элемент3.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Основной");
		ОтборЭлемента3.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента3.ПравоеЗначение = Истина;
		Элемент3.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина, Истина, , )); 
	КонецЕсли;
	//-- #1260 смарт: Фролов 05.12.2022
	
	//++ #Б-1498 смарт: Фролов 12.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
	Если ТипЗнч(ВладелецФайла) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт") Тогда
		
		НовыйЭлемент = Элементы.Добавить("смартНазначениеФайла", Тип("ПолеФормы"), Элементы.Список);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Список.НазначениеФайла";
		НовыйЭлемент.Заголовок = "Назначение файла (смарт)";
		НовыйЭлемент.Видимость = Истина;
		
	КонецЕсли;
	//-- #Б-1498 смарт: Фролов 12.12.2024 
	
	//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("смартPDFДокумент", Новый ОписаниеТипов("ДокументPDF")));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовыйЭлемент = Элементы.Добавить("смартPDFДокумент", Тип("ПолеФормы"), Элементы.ГруппаФайлы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеPDFДокумента;
	НовыйЭлемент.ПутьКДанным = "смартPDFДокумент";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	Элементы.смартPDFДокумент.Видимость = Ложь;
	//-- #Б-6426 смарт: Фролов 17.04.2026
	#КонецВставки

КонецПроцедуры //-- #Б-1498 смарт: Фролов 12.12.2024

&НаКлиенте
&ИзменениеИКонтроль("СписокВыбор")
//++ #Б-1498 смарт: Фролов 13.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
Процедура смарт_СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Вставка
	//++ #Б-1498 смарт: Фролов 13.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
	Если Поле.Имя = "смартНазначениеФайла" Тогда
		
		СписокВыбора = Новый СписокЗначений;
		//++ #Б-3804 смарт: Лопато 16.07.2025 //Заявка на гарантийный ремонт. Назначение файлов.  
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.Акт"));
		//-- #Б-3804 смарт: Лопато 16.07.2025
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.ФотоШильдаОборудования"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.ФотоШильдаДетали"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.ФотоКодаОшибки"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.ФотоПовреждений"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.ФотоДефектныхДеталей"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.СкриншотПереписки"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.СкриншотЗапросаГарантии"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.СкриншотПодтвержденияИлиОтказаОтГарантии"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.смартНазначенияФайлов.СканТестаПечати"));
		
		ПараметрыДляВыбора = Новый Структура;
		ПараметрыДляВыбора.Вставить("ТекущиеДанные", ТекущиеДанные);
		
		Описание = Новый ОписаниеОповещения("смартВыборНазначенияФайлаЗавершение",ЭтаФорма, ПараметрыДляВыбора);
		
		ПоказатьВыборИзМеню(Описание, СписокВыбора, Элемент);
		
		Возврат;
		
	КонецЕсли;
	//-- #Б-1498 смарт: Фролов 13.12.2024
	#КонецВставки

	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьЗначение(, ВыбраннаяСтрока);
		Возврат;
	КонецЕсли;

	КакОткрывать = РаботаСФайламиСлужебныйКлиент.ПерсональныеНастройкиРаботыСФайлами().ДействиеПоДвойномуЩелчкуМыши;

	Если КакОткрывать = "ОткрыватьКарточку" Тогда
		ПоказатьЗначение(, ВыбраннаяСтрока);
		Возврат;
	КонецЕсли;

	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ВыбраннаяСтрока,
	Неопределено, УникальныйИдентификатор, Неопределено, ПредыдущийАдресФайла);

	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	Обработчик = Новый ОписаниеОповещения("СписокВыборПослеВыбораРежимаРедактирования", ЭтотОбъект, ПараметрыОбработчика);

	РаботаСФайламиСлужебныйКлиент.ВыбратьРежимИРедактироватьФайл(Обработчик, ДанныеФайла, Не ДанныеФайла.Служебный);

КонецПроцедуры //-- #Б-1498 смарт: Фролов 13.12.2024

#Конецобласти

#Область ДоработкиСмарт 

&НаКлиенте
&ИзменениеИКонтроль("ОбновитьПредпросмотр")
//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
Процедура смарт_ОбновитьПредпросмотр()

	Если Не Предпросмотр Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И РасширенияПоддерживающиеПредпросмотр.НайтиПоЗначению(ТекущиеДанные.Расширение) <> Неопределено Тогда

		Попытка
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка, Неопределено, УникальныйИдентификатор,, АдресДанныхФайла);
			#Удаление //++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
			АдресДанныхФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
			#КонецУдаления
			#Вставка
			//++ #Б-6426 смарт: Фролов 17.04.2026 //Реализовать предпросмотр присоединенных PDF файлов
			Если ДанныеФайла.Расширение = "pdf" Тогда
				
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
				Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
				ЭтаФорма.смартPDFДокумент.Прочитать(Поток);

				Элементы.смартPDFДокумент.Видимость = Истина; 
				Элементы.АдресДанныхФайла.Видимость = Ложь;
				Элементы.смартPDFДокумент.Документ = ЭтаФорма.смартPDFДокумент;
				
			Иначе
				
				Элементы.смартPDFДокумент.Видимость = Ложь;
				Элементы.АдресДанныхФайла.Видимость = Истина;
				АдресДанныхФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
				
			КонецЕсли;
			//-- #Б-6426 смарт: Фролов 17.04.2026
			#КонецВставки
		Исключение
			// Если файла не существует, то будет вызвано исключение.
			АдресДанныхФайла         = Неопределено;
			ТекстНевыбраннойКартинки = НСтр("ru = 'Предварительный просмотр недоступен по причине:'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

	Иначе

		АдресДанныхФайла         = Неопределено;
		ТекстНевыбраннойКартинки = НСтр("ru = 'Нет данных для предварительного просмотра'");

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресДанныхФайла) Тогда
		Элементы.АдресДанныхФайла.ТекстНевыбраннойКартинки = ТекстНевыбраннойКартинки;
	КонецЕсли;

КонецПроцедуры //-- #Б-6426 смарт: Фролов 17.04.2026

//++ #1260 смарт: Фролов 05.12.2022 //Прикрепить фото к сериям оборудования  
&НаКлиенте
Процедура смартСделатьОсновным()
	смартСделатьОсновнымНаСервере();
КонецПроцедуры //-- #1260 смарт: Фролов 05.12.2022	

//++ #1260 смарт: Фролов 05.12.2022 //Прикрепить фото к сериям оборудования  
&НаСервере
Процедура смартСделатьОсновнымНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СерииНоменклатурыПрисоединенныеФайлы.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Справочник.СерииНоменклатурыПрисоединенныеФайлы КАК СерииНоменклатурыПрисоединенныеФайлы
	                    |ГДЕ
	                    |	СерииНоменклатурыПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	                    |	И СерииНоменклатурыПрисоединенныеФайлы.Основной");  
	Запрос.УстановитьПараметр("ВладелецФайла",ЭтаФорма.ВладелецФайла);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		Об=Выборка.Ссылка.ПолучитьОбъект();	
		Об.Основной=Ложь;
		Об.ОбменДанными.Загрузка=Истина;
		Об.Записать();
	КонецЕсли;	
	Об=ЭтаФорма.Элементы.Список.ТекущаяСтрока.Ссылка.ПолучитьОбъект();	
	Об.Основной=Истина;
	Об.ОбменДанными.Загрузка=Истина;
	Об.Записать();
	Элементы.Список.Обновить();
КонецПроцедуры //-- #1260 смарт: Фролов 05.12.2022	

&НаСервере
//++ #Б-1498 смарт: Фролов 13.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
Процедура смартУстановитьНазначениеФайла(СсылкаНаСправочник, НазначениеФайла);
	
	ОбъектПрисоединенныйФайл = СсылкаНаСправочник.ПолучитьОбъект();
	ОбъектПрисоединенныйФайл.НазначениеФайла = НазначениеФайла;
	ОбъектПрисоединенныйФайл.Записать();
	
КонецПроцедуры //-- #Б-1498 смарт: Фролов 13.12.2024	

&НаКлиенте
//++ #Б-1498 смарт: Фролов 13.12.2024 //Доработка документа Заявка на гарантийный ремонт (смарт)
Процедура смартВыборНазначенияФайлаЗавершение(ВыбранныйЭлемент, Параметры) Экспорт

	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		смартУстановитьНазначениеФайла(Параметры.ТекущиеДанные.Ссылка, ВыбранныйЭлемент.Значение);
		Элементы.Список.Обновить();
	КонецЕсли;	

КонецПроцедуры; //-- #Б-1498 смарт: Фролов 13.12.2024


#Конецобласти
